---
kind: property
id: P:Autodesk.Revit.DB.ReloadSwapOutInfo.PreviousVersion
source: html/52aaf224-8027-840f-bb87-2af9d0895a3d.htm
---
# Autodesk.Revit.DB.ReloadSwapOutInfo.PreviousVersion Property

Previous version.

## Syntax (C#)
```csharp
public int PreviousVersion { get; }
```